load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">/Users/vaya/Documents/Workspace/Maverick/docker-kong/jmeter-lib/javax.activation-api-1.2.0.jar,/Users/vaya/Documents/Workspace/Maverick/docker-kong/jmeter-lib/jaxb-api-2.3.1.jar,/Users/vaya/Documents/Workspace/Maverick/docker-kong/jmeter-lib/hello-world/build/libs/fat-hello-world-1.0-SNAPSHOT.jar</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">50</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Once Only - Prep Key Exchange" enabled="true"/>
        <hashTree>
          <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler - Key Exchange" enabled="true">
            <stringProp name="scriptLanguage">java</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.UUID;
import mav.LoadTest;
import mav.LoadTest.KeyPair;

String deviceId = UUID.randomUUID().toString();

LoadTest lt = new LoadTest();

KeyPair keyPair = lt.keyExchange(
	&quot;http://localhost:8080/key-exchange&quot;,
	deviceId
	);

vars.put(&quot;deviceId&quot;, deviceId);
vars.put(&quot;signServerPublicKey&quot;, keyPair.getHex_sign_s_public_key());
vars.put(&quot;encServerPublicKey&quot;, keyPair.getHex_enc_s_public_key());
vars.put(&quot;signClientPublicKey&quot;, keyPair.getHex_sign_c_public_key());
vars.put(&quot;signClientPrivateKey&quot;, keyPair.getHex_sign_c_private_key());
vars.put(&quot;encClientPublicKey&quot;, keyPair.getHex_enc_c_public_key());
vars.put(&quot;encClientPrivateKey&quot;, keyPair.getHex_enc_c_private_key());
vars.put(&quot;encServerPrivateKey&quot;, keyPair.getHex_enc_s_private_key());</stringProp>
          </JSR223Sampler>
          <hashTree>
            <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
              <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree/>
          </hashTree>
        </hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler - Sign &amp; Encrypt Payload" enabled="true">
          <stringProp name="scriptLanguage">java</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import javax.xml.bind.DatatypeConverter;
import mav.LoadTest;

public class ByteArrayPair {
    private final Object first;
    private final Object second;

    public ByteArrayPair(Object first, Object second) {
        this.first = first;
        this.second = second;
    }

    public Object getFirst() {
        return first;
    }

    public Object getSecond() {
        return second;
    }
}

String request = &quot;{\&quot;age\&quot;:30,\&quot;name\&quot;:\&quot;Lorem ipsum dolor sit amet, consectetur adipiscing elit. Vestibulum facilisis mauris tellus, vel ultrices mauris viverra eget. Nunc posuere tortor a enim iaculis condimentum. Aliquam erat volutpat. Etiam porta purus non eros posuere, ac sollicitudin lectus tincidunt. Suspendisse iaculis interdum tortor id blandit. Aliquam in ex blandit, efficitur turpis vitae, malesuada enim. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed nec massa fermentum nunc tincidunt convallis a at purus. Nam scelerisque mi quis consequat condimentum. Quisque consequat, libero sed pellentesque convallis, massa turpis interd\&quot;}&quot;;

LoadTest lt = new LoadTest();

byte[] signature = lt.signMessage(
	DatatypeConverter.parseHexBinary(vars.get(&quot;signClientPrivateKey&quot;)),
	request.getBytes()
	);

ByteArrayPair pair = lt.encrypt(
	DatatypeConverter.parseHexBinary(vars.get(&quot;encClientPrivateKey&quot;)),
	DatatypeConverter.parseHexBinary(vars.get(&quot;encServerPublicKey&quot;)),
	signature
	);

vars.put(&quot;reqNonce&quot;, DatatypeConverter.printHexBinary(pair.getFirst()));
vars.put(&quot;reqCiphertext&quot;, DatatypeConverter.printHexBinary(pair.getSecond()));

</stringProp>
        </JSR223Sampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request - Transaction" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;nonce&quot;: &quot;${reqNonce}&quot;,&#xd;
	&quot;ciphertext&quot;: &quot;${reqCiphertext}&quot;	&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/wiremock/api/github/users/octocat</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">X-Device-ID</stringProp>
                <stringProp name="Header.value">${deviceId}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">X-Downstream-Enc</stringProp>
                <stringProp name="Header.value">true</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">X-Upstream-Enc</stringProp>
                <stringProp name="Header.value">true</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">respNonce</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$..nonce</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">respCiphertext</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$..ciphertext</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler - Decrypt &amp; Verify Payload" enabled="true">
          <stringProp name="scriptLanguage">java</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import javax.xml.bind.DatatypeConverter;
import mav.LoadTest;

String nonce = vars.get(&quot;respNonce&quot;);
String ciphertext = vars.get(&quot;respCiphertext&quot;);

LoadTest lt = new LoadTest();

byte[] signature = lt.decrypt(
	DatatypeConverter.parseHexBinary(vars.get(&quot;encClientPrivateKey&quot;)),
	DatatypeConverter.parseHexBinary(vars.get(&quot;encServerPublicKey&quot;)),
	DatatypeConverter.parseHexBinary(vars.get(&quot;respNonce&quot;)),
	DatatypeConverter.parseHexBinary(vars.get(&quot;respCiphertext&quot;))
	);

byte[] response = lt.verifySignature(
	DatatypeConverter.parseHexBinary(vars.get(&quot;signServerPublicKey&quot;)),
	signature
	);

return new String(response);</stringProp>
        </JSR223Sampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>