result/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 6404,
    "errorCount" : 40,
    "errorPct" : 0.6246096,
    "meanResTime" : 28.803872579637698,
    "medianResTime" : 16.0,
    "minResTime" : 3.0,
    "maxResTime" : 925.0,
    "pct1ResTime" : 70.0,
    "pct2ResTime" : 86.0,
    "pct3ResTime" : 131.94999999999982,
    "throughput" : 121.13645821510991,
    "receivedKBytesPerSec" : 614.0735501964873,
    "sentKBytesPerSec" : 466.7686491554118
  },
  "HTTP Request - Transaction Plain" : {
    "transaction" : "HTTP Request - Transaction Plain",
    "sampleCount" : 1600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.654999999999966,
    "medianResTime" : 7.0,
    "minResTime" : 3.0,
    "maxResTime" : 258.0,
    "pct1ResTime" : 56.0,
    "pct2ResTime" : 67.0,
    "pct3ResTime" : 99.0,
    "throughput" : 30.504079920689392,
    "receivedKBytesPerSec" : 158.959620224205,
    "sentKBytesPerSec" : 159.25274536719286
  },
  "JSR223 Sampler - Decrypt & Verify Payload" : {
    "transaction" : "JSR223 Sampler - Decrypt & Verify Payload",
    "sampleCount" : 1600,
    "errorCount" : 20,
    "errorPct" : 1.25,
    "meanResTime" : 14.078750000000005,
    "medianResTime" : 12.0,
    "minResTime" : 5.0,
    "maxResTime" : 190.0,
    "pct1ResTime" : 21.0,
    "pct2ResTime" : 24.0,
    "pct3ResTime" : 52.98000000000002,
    "throughput" : 30.498265411154744,
    "receivedKBytesPerSec" : 147.73230207102281,
    "sentKBytesPerSec" : 0.0
  },
  "JSR223 Sampler - Key Exchange" : {
    "transaction" : "JSR223 Sampler - Key Exchange",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 61.25,
    "medianResTime" : 41.5,
    "minResTime" : 20.0,
    "maxResTime" : 142.0,
    "pct1ResTime" : 142.0,
    "pct2ResTime" : 142.0,
    "pct3ResTime" : 142.0,
    "throughput" : 1.309757694826457,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "JSR223 Sampler - Sign & Encrypt Payload" : {
    "transaction" : "JSR223 Sampler - Sign & Encrypt Payload",
    "sampleCount" : 1600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.409374999999955,
    "medianResTime" : 15.0,
    "minResTime" : 6.0,
    "maxResTime" : 192.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 67.98000000000002,
    "throughput" : 30.365140818340542,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "HTTP Request - Transaction Encrypted" : {
    "transaction" : "HTTP Request - Transaction Encrypted",
    "sampleCount" : 1600,
    "errorCount" : 20,
    "errorPct" : 1.25,
    "meanResTime" : 63.99124999999997,
    "medianResTime" : 60.0,
    "minResTime" : 4.0,
    "maxResTime" : 925.0,
    "pct1ResTime" : 99.0,
    "pct2ResTime" : 117.0,
    "pct3ResTime" : 180.99,
    "throughput" : 30.441400304414003,
    "receivedKBytesPerSec" : 311.55879515672564,
    "sentKBytesPerSec" : 310.56062416761796
  }
}